УРВ_файловая/src/Documents/ПланированиеЗагрузкиЛК/ПланированиеЗагрузкиЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланированиеЗагрузкиЛК</name>
  <registerRecords>InformationRegister.РасписаниеКонсультаций</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Замещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перепланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ПользователиСервисов</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаписи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайнийСрок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьЗамещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтменяемыеПланы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Documents/ПланированиеЗагрузкиЛК/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура РаботыДатаВремяНачалаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяНачалаПриИзменении(ТекущиеДанные.ДатаВремяНачала, ТекущиеДанные.ДатаВремяОкончания, ТекущиеДанные.Продолжительность, "Работы[" + (ТекущиеДанные.НомерСтроки - 1) + "].ДатаВремяНачала", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РаботыДатаВремяОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяОкончанияПриИзменении(ТекущиеДанные.ДатаВремяНачала, ТекущиеДанные.ДатаВремяОкончания, ТекущиеДанные.Продолжительность, "Работы[" + (ТекущиеДанные.НомерСтроки - 1) + "].ДатаВремяОкончания", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПродолжительностьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	БоР_ОбщийМодульКлиентСервер.УРВ_ПродолжительностьПриИзменении(ТекущиеДанные.ДатаВремяНачала, ТекущиеДанные.ДатаВремяОкончания, ТекущиеДанные.Продолжительность, "Работы[" + (ТекущиеДанные.НомерСтроки - 1) + "].Продолжительность", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	РаботаПоРасписанию = БоР_ОбщийМодуль.ПолучитьПолеОбъекта(ТекущиеДанные.Работа ,"РаботаПоРасписанию");
	Если РаботаПоРасписанию Тогда
		//ТекущиеДанные.Задание			= Неопределено;
		//ТекущиеДанные.ПакетЧасов		= Неопределено;
		ТекущиеДанные.КрайнийСрок		= Неопределено;
		ТекущиеДанные.Событие			= Неопределено;
	КонецЕсли;
	ТребуетУказанияКонтрагента = БоР_ОбщийМодуль.ПолучитьПолеОбъекта(ТекущиеДанные.Работа ,"ТребуетУказанияКонтрагента");
	Если Не ТребуетУказанияКонтрагента Тогда
		ТекущиеДанные.Контрагент		= Неопределено;
		ТекущиеДанные.КонтактноеЛицо	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменяемыеПланыДатаВремяНачалаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтменяемыеПланы.ТекущиеДанные;
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяНачалаПриИзменении(ТекущиеДанные.ДатаВремяНачала, ТекущиеДанные.ДатаВремяОкончания, ТекущиеДанные.Продолжительность, "ОтменяемыеПланы[" + (ТекущиеДанные.НомерСтроки - 1) + "].ДатаВремяНачала", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтменяемыеПланыПродолжительностьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтменяемыеПланы.ТекущиеДанные;
	БоР_ОбщийМодульКлиентСервер.УРВ_ПродолжительностьПриИзменении(ТекущиеДанные.ДатаВремяНачала, ТекущиеДанные.ДатаВремяОкончания, ТекущиеДанные.Продолжительность, "ОтменяемыеПланы[" + (ТекущиеДанные.НомерСтроки - 1) + "].ДатаВремяОкончания", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтменяемыеПланыДатаВремяОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтменяемыеПланы.ТекущиеДанные;
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяОкончанияПриИзменении(ТекущиеДанные.ДатаВремяНачала, ТекущиеДанные.ДатаВремяОкончания, ТекущиеДанные.Продолжительность, "ОтменяемыеПланы[" + (ТекущиеДанные.НомерСтроки - 1) + "].Продолжительность", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПерепланированиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

// БоР :  17.08.2017 16:03:23
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(ЭтаФорма) Экспорт
	ЭтаФорма.Элементы.СтраницаОтменяемыеПланы.Видимость = ЭтаФорма.Объект.Перепланирование;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "РаботыОписаниеТекст" Тогда
		РедактируемаяСтрока = Объект.Работы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если РедактируемаяСтрока = Неопределено Тогда
			ВозВрат;
		КонецЕсли;
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОписаниеXML"					, РедактируемаяСтрока.ОписаниеXML);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		
		ИмяФормыДляОткрытия = "Обработка.РасписаниеЛК.Форма.ФормаВводаОписания";
		БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "РаботыВыбор_Завершение", ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыВыбор_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	ВыбраннаяСтрока = Неопределено;
	ДополнительныеПараметры.Свойство("ВыбраннаяСтрока", ВыбраннаяСтрока);
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		РедактируемаяСтрока = Объект.Работы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если РедактируемаяСтрока = Неопределено Тогда
			ВозВрат;
		КонецЕсли;
		РедактируемаяСтрока.ОписаниеXML		= Результат.ОписаниеXML;
		РедактируемаяСтрока.ОписаниеТекст	= Результат.ОписаниеТекст;
	КонецЕсли;

КонецПроцедуры
